<?
/*
* @date : 20180873
* @author : chunter
* @brief : 관리자 메뉴의 센터별, 몰별 제거할 메뉴 설정
* @desc : _inc_service_config.php 에서 사용
*/
?>
<?
//센터별 제거할 메뉴 관리.
//유니큐브 센터
$center_exclude_menu['210.220.150.13_municube'] = array(
	array(_("상품관리"),	   	
		array(_("견적관리"), _("견적가격설정"),_("항목이미지설정"),_("항목도움말설정"),_("항목설명설정"),_("책자상품항목설정"),_("낱장상품항목설정"),_("옵셋상품항목설정"),_("항목제약사항설정"))
	),
	array(_("게시판관리"),	   	
		array(_("편집왕"), _("편집왕관리"),_("편집왕리스트"))
	),      
);

//포토큐브 센터
$center_exclude_menu['210.220.150.30_mcenter'] = array(
	array(_("상품관리"),	   	
		array(_("견적관리"), _("견적가격설정"),_("항목이미지설정"),_("항목도움말설정"),_("항목설명설정"),_("책자상품항목설정"),_("낱장상품항목설정"),_("옵셋상품항목설정"),_("항목제약사항설정"))
	),      
);

//미오디오 센터
$center_exclude_menu['210.220.150.35_mcenter'] = array(
	array(_("상품관리"),	   	
		array(_("견적관리"), _("견적가격설정"),_("항목이미지설정"),_("항목도움말설정"),_("항목설명설정"),_("책자상품항목설정"),_("낱장상품항목설정"),_("옵셋상품항목설정"),_("항목제약사항설정"))
	),
	array(_("게시판관리"),	   	
		array(_("편집왕"), _("편집왕관리"),_("편집왕리스트"))
	),      
);

//아이락 센터
$center_exclude_menu['210.220.150.13_mcenter'] = array(
	array(_("상품관리"),	   	
		array(_("견적가격설정"),_("항목이미지설정"),_("항목도움말설정"),_("항목설명설정"),_("책자상품항목설정"),_("낱장상품항목설정"),_("옵셋상품항목설정"),_("항목제약사항설정"))
	),      
);

//아이락 센터 -> 알래스카 몰
$center_exclude_menu['210.220.150.13_mcenter_alaskaprint'] = array(
	array(_("게시판관리"),	   	
		array(_("편집왕"), _("편집왕관리"),_("편집왕리스트"))
	),      
);

//인터프로 센터
$center_exclude_menu['210.220.150.13_minterpro'] = array(
	array(_("게시판관리"),	   	
		array(_("편집왕"), _("편집왕관리"),_("편집왕리스트"))
	),      
);

//개발(배포)센터 - mcdev 
$center_exclude_menu['210.220.150.13_mcdev'] = array(
    array(_("상품관리"),        
        array(_("견적가격설정"),_("항목이미지설정"),_("항목도움말설정"),_("항목설명설정"),_("책자상품항목설정"),_("낱장상품항목설정"),_("옵셋상품항목설정"),_("항목제약사항설정"))
    ),      
	array(_("게시판관리"),	   	
		array(_("편집왕"), _("편집왕관리"),_("편집왕리스트"))
	),      
);
?>