<?php 
/*--------------------------------------------------
  가맹점 정보 관련 환경 설정 파일
  author: 
  updated date: 2013.06.13
--------------------------------------------------*/

//SK key 값
$config['sklte_key'] = 'PQz40EvT.JuJoCEeEddP7GZQ';

//제휴사 코드
$config['sklte_van'] = 'S625';

//응답코드 - Ver1.89 기준
$config['sklte_error_code'] = array(
 		'00' =>'정상',
 		'01' =>'이미취소',
 		'10' =>'전송일시오류',
 		'11' =>'전문고유번호오류',
 		'12' =>'통신망관리정보오류',
 		'13' =>'POS ENTRY오류',
 		'14' =>'취급기관 오류',
 		'15' =>'단말,가맹점코드 오류',
 		'16' =>'통화코드 오류',
 		'17' =>'거래금액 오류',
 		'18' =>'Track오류',
 		'19' =>'취소구분',
 		'20' =>'취소할승인번호 오류',
 		'21' =>'전문ID오류',
 		'22' =>'상품코드오류',
 		'23' =>'미입장카드',
 		'28' =>'SKT 제휴 카드 아님',
 		'29' =>'모네타카드 불일치',
 		'30' =>'사용불능 카드',
 		'31' =>'사용정지카드',
 		'32' =>'조회불능카드',
 		'33' =>'불량가맹점',
 		'34' =>'말소가맹점',
 		'35' =>'등록Van사 다름',
 		'36' =>'말소단말기',
 		'37' =>'유효기간 초과',
 		'38' =>'유효기간 표시',
 		'39' =>'하나SK더블할인대상카드아님',
 		'40' =>'한도초과',
 		'41' =>'년한도초과',
 		'42' =>'일한도초과',
 		'43' =>'사용횟수초과(월,년)',
 		'45' =>'개인한도 소진',
 		'49' =>'VIP 일반전환 승인',
 		'50' =>'취소할승인번호 없음',
 		'51' =>'취소할금액이 다름',
 		'52' =>'가맹점미등록 Segment',
 		'53' =>'멤버십번호 업데이트 필요',
 		'54' =>'주민번호상이',
 		'55' =>'수령확인등록 후 사용요망',
 		'56' =>'나이제한',
 		'57' =>'거래요일오류',
 		'58' =>'이미가입되어있음',
 		'80' =>'Check기준오류',
 		'81' =>'VIP아님(스피드메이트)',
 		'90' =>'시스템 장애',
 		'91' =>'시스템지연',
 		'95' =>'시스템취소(오류자료)',
 		'99' =>'시스템접속거부',
 );
 
 
//SK서버주소
$config['sk_server_ip_addr'] = '203.236.17.50';
$config['sk_server_port'] = '8014'; //개발:8014 운영:8011

?>