<?
    /* ============================================================================== */
    /* =   PAGE : 공통 통보 PAGE                                                    = */
    /* = -------------------------------------------------------------------------- = */
    /* =   Copyright (c)  2006   KCP Inc.   All Rights Reserverd.                   = */
    /* ============================================================================== */
?>
<?
    /* ============================================================================== */
    /* =   01. 공통 통보 페이지 설명(필독!!)                                        = */
    /* = -------------------------------------------------------------------------- = */
    /* =   에스크로 서비스의 경우, 가상계좌 입금 통보 데이터와 가상계좌 환불        = */
    /* =   통보 데이터, 구매확인/구매취소 통보 데이터, 배송시작 통보 데이터 등을    = */
    /* =   KCP 를 통해 별도로 통보 받을 수 있습니다. 이러한 통보 데이터를 받기      = */
    /* =   위해 가맹점측은 결과를 전송받는 페이지를 마련해 놓아야 합니다.           = */
    /* =   현재의 페이지를 업체에 맞게 수정하신 후, KCP 관리자 페이지에 등록해      = */
    /* =   주시기 바랍니다. 등록 방법은 연동 매뉴얼을 참고하시기 바랍니다.          = */
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   02. 공통 통보 데이터 받기                                                = */
    /* = -------------------------------------------------------------------------- = */
    $site_cd      = $_POST [ "site_cd"  ];                 // 사이트 코드
    $tno          = $_POST [ "tno"      ];                 // KCP 거래번호
    $order_no     = $_POST [ "order_no" ];                 // 주문번호
    $tx_cd        = $_POST [ "tx_cd"    ];                 // 업무처리 구분 코드
    $tx_tm        = $_POST [ "tx_tm"    ];                 // 업무처리 완료 시간
    /* = -------------------------------------------------------------------------- = */
    $ipgm_name    = "";                                    // 주문자명
    $remitter     = "";                                    // 입금자명
    $ipgm_mnyx    = "";                                    // 입금 금액
    $bank_code    = "";                                    // 은행코드
    $account      = "";                                    // 가상계좌 입금계좌번호
    $op_cd        = "";                                    // 처리구분 코드
    $noti_id      = "";                                    // 통보 아이디
    /* = -------------------------------------------------------------------------- = */
    $refund_nm    = "";                                    // 환불계좌주명
    $refund_mny   = "";                                    // 환불금액
    $bank_code    = "";                                    // 은행코드
    /* = -------------------------------------------------------------------------- = */
    $st_cd        = "";                                    // 구매확인 코드
    $can_msg      = "";                                    // 구매취소 사유
    /* = -------------------------------------------------------------------------- = */
    $waybill_no   = "";                                    // 운송장 번호
    $waybill_corp = "";                                    // 택배 업체명

    /* = -------------------------------------------------------------------------- = */
    /* =   02-1. 가상계좌 입금 통보 데이터 받기                                     = */
    /* = -------------------------------------------------------------------------- = */
    if ( $tx_cd == "TX00" )
    {
        $ipgm_name = $_POST[ "ipgm_name" ];                // 주문자명
        $remitter  = $_POST[ "remitter"  ];                // 입금자명
        $ipgm_mnyx = $_POST[ "ipgm_mnyx" ];                // 입금 금액
        $bank_code = $_POST[ "bank_code" ];                // 은행코드
        $account   = $_POST[ "account"   ];                // 가상계좌 입금계좌번호
        $op_cd     = $_POST[ "op_cd"     ];                // 처리구분 코드
        $noti_id   = $_POST[ "noti_id"   ];                // 통보 아이디
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-2. 가상계좌 환불 통보 데이터 받기                                     = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX01" )
    {
        $refund_nm  = $_POST[ "refund_nm"  ];              // 환불계좌주명
        $refund_mny = $_POST[ "refund_mny" ];              // 환불금액
        $bank_code  = $_POST[ "bank_code"  ];              // 은행코드
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-3. 구매확인/구매취소 통보 데이터 받기                                 = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX02" )
    {
        $st_cd = $_POST[ "st_cd" ];                        // 구매확인 코드

        if ( $st_cd == "N" )                               // 구매확인 상태가 구매취소인 경우
        {
            $can_msg = $_POST[ "can_msg" ];                // 구매취소 사유
        }
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-4. 배송시작 통보 데이터 받기                                          = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX03" )
    {
        $waybill_no   = $_POST[ "waybill_no"   ];          // 운송장 번호
        $waybill_corp = $_POST[ "waybill_corp" ];          // 택배 업체명
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-5. 모바일안심결제 통보 데이터 받기                                    = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX08" )
    {
        $ipgm_mnyx = $_POST[ "ipgm_mnyx" ];                // 입금 금액
        $bank_code = $_POST[ "bank_code" ];                // 은행코드
    }
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   03. 공통 통보 결과를 업체 자체적으로 DB 처리 작업하시는 부분입니다.      = */
    /* = -------------------------------------------------------------------------- = */
    /* =   통보 결과를 DB 작업 하는 과정에서 정상적으로 통보된 건에 대해 DB 작업을  = */
    /* =   실패하여 DB update 가 완료되지 않은 경우, 결과를 재통보 받을 수 있는     = */
    /* =   프로세스가 구성되어 있습니다. 소스에서 result 라는 Form 값을 생성 하신   = */
    /* =   후, DB 작업이 성공 한 경우, result 의 값을 "0000" 로 세팅해 주시고,      = */
    /* =   DB 작업이 실패 한 경우, result 의 값을 "0000" 이외의 값으로 세팅해 주시  = */
    /* =   기 바랍니다. result 값이 "0000" 이 아닌 경우에는 재통보를 받게 됩니다.   = */
    /* = -------------------------------------------------------------------------- = */
    
//전달받는 데이터 로그 / 15.11.03 / kjm
//로그 내용을 print_r로 찍도록 변경 / 18.03.22 / kjm
include_once "../../lib/library.php";
include_once "../../pretty/_module_util.php";
ob_start();
$fp = fopen("log/$order_no"."_POST","a+");
print_r($_REQUEST);
$ret = ob_get_contents();
fwrite($fp,$ret);
fclose($fp);
ob_end_clean();

   /* = -------------------------------------------------------------------------- = */
   /* =   03-1. 가상계좌 입금 통보 데이터 DB 처리 작업 부분                        = */
   /* = -------------------------------------------------------------------------- = */
   if ( $tx_cd == "TX00" )
   {
      ### 핵심 함수 연결
  		$ret = true;
  		$data = $db->fetch("select * from exm_pay where payno='$order_no'");
  		
  		if ($data)
      {
         if ($data[paydt]) $ret = false;
  		   if (!$data[payno]) $ret = false;
         //결제 번호가 1이 아니면 PODS통신 및 결제, 아이템 스텝 변경 불가, 자동 메일, sms 발송 불가 / 15.04.30 / kjm
         if ($data[paystep] != 1) $ret = false;
      } else {
         $ret = false;
      }

      //결제 데이터 & ret 데이터 로그 / 15.11.03 / kjm
      //include "../../lib/library.php";
      ob_start();
      $fp = fopen("log/$order_no"."_POST","a+");
      print_r($data);
      print_r($ret);
      $ret = ob_get_contents();
      fwrite($fp,$ret);
      fclose($fp);
      ob_end_clean();
  
  		if ($ret){
  			$db->query("update exm_pay set memo = 1 where payno='$order_no'");
  			include_once "../../lib/nusoap/lib/nusoap.php";
  			$client = new soapclient("http://podstation.ilark.co.kr/StationWebService/StationWebService.asmx?WSDL",true);
  			$client->xml_encoding = "UTF-8";
  			$client->soap_defencoding = "UTF-8";
  			$client->decode_utf8 = false;
  			
  			$db->query("update exm_pay set paystep=2, paydt=now() where payno='$order_no'");
  			$db->query("update exm_ord_item set itemstep=2 where payno='$order_no'");
  
  			$paydata = $db->fetch("select * from exm_pay where payno = '$order_no'");
  			$query = "select * from exm_ord_item where payno = '$order_no'";
  			$res = $db->query($query);
  			while ($tmp = $db->fetch($res)){
  				set_pod_pay($tmp[payno],$tmp[ordno],$tmp[ordseq]);
  				set_acc_desc($tmp[payno],$tmp[ordno],$tmp[ordseq],2);
  				$paydata[item][] = $tmp;
  			}
			
			//20190118 / minks / 배송방법 추가
			list($ordershiptype) = $db->fetch("select order_shiptype from exm_ord where payno='$order_no' order by ordno limit 1", 1);
			$paydata[ordershiptype] = ($cfg[skin_theme] == "P1" && $ordershiptype == 1) ? $r_order_shiptype[0] : $r_order_shiptype[$ordershiptype];
			
  			autoMail("payment",$paydata[orderer_email],$paydata);
         
         //관리자에게 보내기
         autoMailAdmin("admin_payment",$cfg[email1],$paydata);
         
  			autoSms("입금확인",$paydata[orderer_mobile],$paydata);
  			order_sms(array($order_no));
         
         $result="0000";
  		}
      else 
      {
         //예치금 입금 처리       20150513    chunter
         $data = $db->fetch("select * from tb_deposit_payno where payno='$order_no'");
         if ($data[payno] && $data[paydt])
         {
            $pglog .= "결제방법 : 가상계좌
                       가상계좌 : $bank_code $account $remitter $op_cd
                       결제금액 : {$ipgm_mnyx}원";
            depositAccountProc($order_no, $ipgm_mnyx, $pglog);

            $result="0000";
         }
         else
         {
            //포인트와 웹하드 결제 처리  가상계좌 입금 통보 데이터 DB 처리 작업 부분     20160526
            $data = $db->fetch("select * from tb_pretty_account_payno where payno='$order_no'");
            if ($data && $data[payno])
            {
               //결제 요청금액과 실제 결제 금액이 같은 경우만 처리한다.
               if ($ipgm_mnyx == $data[account_money])
               {
                  $db->query("update tb_pretty_account_payno set paydt=now() where payno='$order_no'");   //결제 완료 처리      20150710    chunter
              
                  $pglog = "주문번호 : $order_no, PG결제번호 : $tno, 결제금액 : $ipgm_mnyx";
                  if ($data[account_type] == "P")
                  {
                     setPointProcess($cid, $data[account_point], "21", '', '', $pglog, $order_no, $tno, "v", $ipgm_mnyx);     //포인트 처리
                     $result="0000";
                  }
                  //스토리지 결제
                  else if ($data[account_type] == "S")
                  {
                     updateStorageData($cid, $data[storage_size], $data[storage_month], $data[storage_account_kind], $ipgm_mnyx, $tno, $order_no, "v", $pglog, $data[account_detail_info]);
                     $result="0000";
                  }
               }
            }
         }
      }
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-2. 가상계좌 환불 통보 데이터 DB 처리 작업 부분                        = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX01" )
   {
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-3. 구매확인/구매취소 통보 데이터 DB 처리 작업 부분                    = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX02" )
   {
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-4. 배송시작 통보 데이터 DB 처리 작업 부분                             = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX03" )
   {
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-5. 정산보류 통보 데이터 DB 처리 작업 부분                             = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX04" )
   {
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-6. 즉시취소 통보 데이터 DB 처리 작업 부분                             = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX05" )
   {
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-7. 취소 통보 데이터 DB 처리 작업 부분                                 = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX06" )
   {
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-8. 발급계좌해지 통보 데이터 DB 처리 작업 부분                         = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX07" )
   {
   }

   /* = -------------------------------------------------------------------------- = */
   /* =   03-9. 모바일안심결제 통보 데이터 DB 처리 작업 부분                       = */
   /* = -------------------------------------------------------------------------- = */
   else if ( $tx_cd == "TX08" )
   {
   }
   /* ============================================================================== */


   /* ============================================================================== */
   /* =   04. result 값 세팅 하기                                                  = */
   /* ============================================================================== */
?>
<html><body><form><input type="hidden" name="result" value="<?=$result?>"></form></body></html>