<?
    /* ============================================================================== */
    /* =   PAGE : 결제 정보 환경 설정 PAGE                                          = */
    /* =----------------------------------------------------------------------------= */
    /* =   연동시 오류가 발생하는 경우 아래의 주소로 접속하셔서 확인하시기 바랍니다.= */
    /* =   접속 주소 : http://kcp.co.kr/technique.requestcode.do                    = */
    /* =----------------------------------------------------------------------------= */
    /* =   Copyright (c)  2013   KCP Inc.   All Rights Reserverd.                   = */
    /* ============================================================================== */

    /* ============================================================================== */
    /* = ※ 주의 ※                                                                 = */
    /* = * g_conf_home_dir 변수 설정                                                = */
    /* =----------------------------------------------------------------------------= */
    /* =   BIN 절대 경로 입력 (bin전까지 설정                                       = */
    /* ============================================================================== */
    //$g_conf_home_dir  = "/data1/newpg/pay/kimhj/ax_hub_linux_jsp_add";       // BIN 절대경로 입력 (bin전까지) 
    $g_conf_home_dir    = dirname(__FILE__)."/payplus";     // BIN 절대경로 입력
    

    /* ============================================================================== */
    /* = ※ 주의 ※                                                                 = */
    /* = * g_conf_log_path 변수 설정                                                = */
    /* =----------------------------------------------------------------------------= */
    /* =   log 경로 지정                                                            = */
    /* ============================================================================== */
    //$g_conf_log_path = "/data1/newpg/pay/kimhj/ax_hub_linux_jsp/bin/log";
    $g_conf_log_path    = dirname(__FILE__)."/payplus/log";
    
    
    $b_test = false;
    
    if ($b_test)
    {    
      $g_conf_gw_url    = "testpaygw.kcp.co.kr";
      $g_conf_js_url    = "https://pay.kcp.co.kr/plugin/payplus_test_un.js";
      $g_wsdl           = "KCPPaymentService.wsdl";
      
      $g_conf_site_cd   = "T0000";
      $g_conf_site_key  = "3grptw1.zW0GSo4PQdaGvsF__";
      
      $g_conf_site_name = "bluepod mall TEST SHOP";
    } else {
      $g_conf_gw_url    = "paygw.kcp.co.kr";
      $g_conf_js_url    = "https://pay.kcp.co.kr/plugin/payplus_un.js";
      $g_wsdl           = "real_KCPPaymentService.wsdl";
      
      //kodac
      $g_conf_site_cd   = "N5072";
      $g_conf_site_key  = "35sQ3jXYPGHnqiPky4itAxl__";
            
      //slr
      //$g_conf_site_cd   = "N1970";
      //$g_conf_site_key  = "0sudTSt1yjejnZT.07pgwYu__";
      
      //alsee (ilark)
      //$g_conf_site_cd   = "N3957";
      //$g_conf_site_key  = "4Kv9GV51axp3yZSEb5xLcmY__";
      
      
      /* = 사이트명 설정(한글 불가) : 반드시 영문자로 설정하여 주시기 바랍니다.       = */
      $g_conf_site_name = $_SERVER[HTTP_HOST];
    }
    
      

    /* ============================================================================== */
    /* = g_conf_site_cd, g_conf_site_key 설정                                       = */
    /* = 실결제시 KCP에서 발급한 사이트코드(site_cd), 사이트키(site_key)를 반드시   = */
    /* = 변경해 주셔야 결제가 정상적으로 진행됩니다.                                = */
    /* =----------------------------------------------------------------------------= */
    /* = 테스트 시 : 사이트코드(T0000)와 사이트키(3grptw1.zW0GSo4PQdaGvsF__)로      = */
    /* =            설정해 주십시오.                                                = */
    /* = 실결제 시 : 반드시 KCP에서 발급한 사이트코드(site_cd)와 사이트키(site_key) = */
    /* =            로 설정해 주십시오.                                             = */
    /* ============================================================================== */
    
    


       

    /* ============================================================================== */
    /* = 지불 데이터 셋업 (변경 불가)                                               = */
    /* ============================================================================== */
    $g_conf_log_level = "3";
    $g_conf_gw_port   = "8090";        // 포트번호(변경불가)
    $module_type      = "01";          // 변경불가
?>
